results_laptop/node_exporter/results/parallel_wrk/output_4.txt
stdout:
--------------------------------------------------------
Running benchmark with 1 threads and 1 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.42us   11.99us   0.94ms   98.41%
    Req/Sec    55.13k     3.81k   61.86k    59.20%
  1101925 requests in 20.10s, 1.11GB read
Requests/sec:  54823.22
Transfer/sec:     56.36MB
--------------------------------------------------------
Running benchmark with 2 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 4 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 8 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 16 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 1 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.30us   40.57us   3.90ms   94.78%
    Req/Sec   168.72k    30.57k  234.02k    65.50%
  3352261 requests in 20.00s, 3.37GB read
Requests/sec: 167608.64
Transfer/sec:    172.31MB
--------------------------------------------------------
Running benchmark with 2 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.34us   53.88us   3.34ms   94.03%
    Req/Sec    95.27k    12.97k  145.05k    90.80%
  3808121 requests in 20.10s, 3.82GB read
Requests/sec: 189458.22
Transfer/sec:    194.77MB
--------------------------------------------------------
Running benchmark with 4 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.66us   48.92us   4.18ms   95.72%
    Req/Sec    43.29k     6.51k   66.35k    90.92%
  3463088 requests in 20.10s, 3.48GB read
Requests/sec: 172299.33
Transfer/sec:    177.13MB
--------------------------------------------------------
Running benchmark with 8 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    54.01us   69.95us   4.93ms   96.45%
    Req/Sec    20.48k     3.16k   31.74k    91.41%
  3275191 requests in 20.10s, 3.29GB read
Requests/sec: 162948.13
Transfer/sec:    167.52MB
--------------------------------------------------------
Running benchmark with 16 threads and 10 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 1 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.96us   93.32us   4.02ms   93.05%
    Req/Sec   161.46k    26.71k  244.51k    80.50%
  3211219 requests in 20.00s, 3.22GB read
Requests/sec: 160558.49
Transfer/sec:    165.06MB
--------------------------------------------------------
Running benchmark with 2 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   133.16us  124.49us   3.34ms   90.07%
    Req/Sec    97.98k    14.28k  152.98k    90.75%
  3896550 requests in 20.00s, 3.91GB read
Requests/sec: 194826.23
Transfer/sec:    200.29MB
--------------------------------------------------------
Running benchmark with 4 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.28us  146.33us   7.01ms   91.05%
    Req/Sec    45.32k     6.76k   70.61k    91.04%
  3624795 requests in 20.10s, 3.64GB read
Requests/sec: 180337.99
Transfer/sec:    185.40MB
--------------------------------------------------------
Running benchmark with 8 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   161.40us  183.71us   7.24ms   93.05%
    Req/Sec    21.59k     3.43k   36.94k    90.97%
  3450620 requests in 20.10s, 3.46GB read
Requests/sec: 171671.73
Transfer/sec:    176.49MB
--------------------------------------------------------
Running benchmark with 16 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   125.50us  278.86us  10.54ms   97.16%
    Req/Sec    10.45k     1.81k   29.17k    89.32%
  3330358 requests in 20.10s, 3.34GB read
Requests/sec: 165691.27
Transfer/sec:    170.34MB
--------------------------------------------------------
Running benchmark with 1 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   205.16us  153.38us   4.54ms   88.90%
    Req/Sec   159.81k    22.39k  237.68k    85.50%
  3178911 requests in 20.00s, 3.19GB read
Requests/sec: 158930.99
Transfer/sec:    163.39MB
--------------------------------------------------------
Running benchmark with 2 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   276.09us  238.25us   4.18ms   82.83%
    Req/Sec    97.28k    14.02k  147.62k    90.50%
  3869328 requests in 20.00s, 3.88GB read
Requests/sec: 193456.99
Transfer/sec:    198.89MB
--------------------------------------------------------
Running benchmark with 4 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   296.52us  248.73us   6.20ms   78.21%
    Req/Sec    45.11k     6.73k   69.91k    90.91%
  3603223 requests in 20.10s, 3.62GB read
Requests/sec: 179265.15
Transfer/sec:    184.30MB
--------------------------------------------------------
Running benchmark with 8 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   318.21us  288.87us   7.09ms   86.70%
    Req/Sec    21.33k     3.41k   38.20k    90.60%
  3410480 requests in 20.10s, 3.42GB read
Requests/sec: 169674.85
Transfer/sec:    174.44MB
--------------------------------------------------------
Running benchmark with 16 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   336.78us  344.24us   7.65ms   89.89%
    Req/Sec    10.43k     1.98k   41.39k    91.04%
  3326637 requests in 20.10s, 3.34GB read
Requests/sec: 165504.96
Transfer/sec:    170.15MB
--------------------------------------------------------
Running benchmark with 1 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   393.85us  261.28us   5.43ms   84.92%
    Req/Sec   162.70k    24.54k  246.34k    87.50%
  3237052 requests in 20.00s, 3.25GB read
Requests/sec: 161820.00
Transfer/sec:    166.36MB
--------------------------------------------------------
Running benchmark with 2 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   559.73us  455.44us   4.68ms   74.01%
    Req/Sec    95.74k    13.49k  145.62k    90.75%
  3808805 requests in 20.00s, 3.82GB read
Requests/sec: 190417.70
Transfer/sec:    195.76MB
--------------------------------------------------------
Running benchmark with 4 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   626.04us  500.26us   7.11ms   69.96%
    Req/Sec    44.15k     6.37k   69.24k    91.17%
  3532061 requests in 20.10s, 3.55GB read
Requests/sec: 175723.43
Transfer/sec:    180.65MB
--------------------------------------------------------
Running benchmark with 8 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   628.65us  511.10us  14.99ms   71.25%
    Req/Sec    21.02k     3.19k   34.12k    91.10%
  3360420 requests in 20.10s, 3.37GB read
Requests/sec: 167188.52
Transfer/sec:    171.88MB
--------------------------------------------------------
Running benchmark with 16 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   652.99us  553.94us  14.41ms   74.24%
    Req/Sec    10.28k     1.93k   41.21k    90.95%
  3276596 requests in 20.10s, 3.29GB read
Requests/sec: 163014.07
Transfer/sec:    167.59MB
--------------------------------------------------------
Running benchmark with 1 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   566.93us  351.47us   4.87ms   84.06%
    Req/Sec   166.34k    24.08k  250.79k    85.00%
  3309795 requests in 20.00s, 3.32GB read
Requests/sec: 165448.78
Transfer/sec:    170.09MB
--------------------------------------------------------
Running benchmark with 2 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   831.53us  666.61us   6.63ms   72.38%
    Req/Sec    96.61k    13.58k  149.80k    90.75%
  3842538 requests in 20.00s, 3.86GB read
Requests/sec: 192116.04
Transfer/sec:    197.51MB
--------------------------------------------------------
Running benchmark with 4 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  737.27us   9.06ms   69.03%
    Req/Sec    43.96k     6.39k   67.48k    90.88%
  3499369 requests in 20.00s, 3.51GB read
Requests/sec: 174940.01
Transfer/sec:    179.85MB
--------------------------------------------------------
Running benchmark with 8 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  755.32us  10.99ms   69.73%
    Req/Sec    21.09k     3.35k   42.67k    90.90%
  3364570 requests in 20.10s, 3.38GB read
Requests/sec: 167391.01
Transfer/sec:    172.09MB
--------------------------------------------------------
Running benchmark with 16 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  811.74us   9.82ms   72.12%
    Req/Sec    10.31k     2.41k   83.58k    91.79%
  3284265 requests in 20.10s, 3.30GB read
Requests/sec: 163406.84
Transfer/sec:    167.99MB
--------------------------------------------------------
Running benchmark with 1 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   741.82us  441.52us  15.10ms   84.12%
    Req/Sec   165.84k    25.25k  251.40k    87.00%
  3300387 requests in 20.01s, 3.31GB read
Requests/sec: 164959.75
Transfer/sec:    169.59MB
--------------------------------------------------------
Running benchmark with 2 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms    0.86ms  13.69ms   70.89%
    Req/Sec    94.21k    13.89k  145.37k    91.00%
  3748974 requests in 20.00s, 3.76GB read
Requests/sec: 187405.27
Transfer/sec:    192.66MB
--------------------------------------------------------
Running benchmark with 4 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms    0.93ms  11.25ms   66.96%
    Req/Sec    43.68k     7.20k  127.73k    91.76%
  3481044 requests in 20.10s, 3.49GB read
Requests/sec: 173186.94
Transfer/sec:    178.05MB
--------------------------------------------------------
Running benchmark with 8 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    0.96ms  10.90ms   67.15%
    Req/Sec    21.11k     3.39k   44.21k    90.96%
  3368962 requests in 20.10s, 3.38GB read
Requests/sec: 167608.39
Transfer/sec:    172.31MB
--------------------------------------------------------
Running benchmark with 16 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    1.03ms  13.16ms   70.82%
    Req/Sec    10.30k     1.65k   22.31k    89.59%
  3282211 requests in 20.02s, 3.30GB read
Requests/sec: 163932.62
Transfer/sec:    168.53MB
--------------------------------------------------------
Running benchmark with 1 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms  550.89us   7.08ms   80.55%
    Req/Sec   165.78k    25.64k  246.31k    79.50%
  3299962 requests in 20.05s, 3.31GB read
Requests/sec: 164599.10
Transfer/sec:    169.22MB
--------------------------------------------------------
Running benchmark with 2 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms    1.08ms  12.41ms   67.56%
    Req/Sec    95.63k    14.26k  149.65k    90.50%
  3804242 requests in 20.03s, 3.82GB read
Requests/sec: 189958.52
Transfer/sec:    195.29MB
--------------------------------------------------------
Running benchmark with 4 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.79ms    1.17ms  11.47ms   65.04%
    Req/Sec    43.65k     6.44k   68.10k    91.38%
  3474050 requests in 20.02s, 3.49GB read
Requests/sec: 173528.45
Transfer/sec:    178.40MB
--------------------------------------------------------
Running benchmark with 8 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms    1.23ms  27.56ms   65.57%
    Req/Sec    20.85k     3.31k   39.88k    91.09%
  3330220 requests in 20.10s, 3.34GB read
Requests/sec: 165689.54
Transfer/sec:    170.34MB
--------------------------------------------------------
Running benchmark with 16 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms    1.26ms  20.96ms   65.63%
    Req/Sec    10.17k     1.75k   27.88k    91.11%
  3242326 requests in 20.10s, 3.26GB read
Requests/sec: 161314.95
Transfer/sec:    165.84MB
--------------------------------------------------------
Running benchmark with 1 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms  623.27us   8.06ms   80.01%
    Req/Sec   156.88k    22.92k  234.07k    81.00%
  3129145 requests in 20.10s, 3.14GB read
Requests/sec: 155678.94
Transfer/sec:    160.05MB
--------------------------------------------------------
Running benchmark with 2 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.11ms    1.27ms  28.81ms   68.61%
    Req/Sec    94.03k    13.96k  151.81k    90.75%
  3741362 requests in 20.05s, 3.76GB read
Requests/sec: 186609.95
Transfer/sec:    191.85MB
--------------------------------------------------------
Running benchmark with 4 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49ms    1.42ms  15.93ms   66.78%
    Req/Sec    41.11k     6.74k   67.37k    92.00%
  3272571 requests in 20.02s, 3.29GB read
Requests/sec: 163429.20
Transfer/sec:    168.02MB
--------------------------------------------------------
Running benchmark with 8 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.51ms    1.44ms  18.18ms   66.61%
    Req/Sec    20.33k     3.82k  102.84k    92.13%
  3237609 requests in 20.10s, 3.25GB read
Requests/sec: 161078.41
Transfer/sec:    165.60MB
--------------------------------------------------------
Running benchmark with 16 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.57ms    1.50ms  21.16ms   67.50%
    Req/Sec     9.98k     1.68k   21.87k    90.89%
  3184684 requests in 20.10s, 3.20GB read
Requests/sec: 158445.13
Transfer/sec:    162.89MB
--------------------------------------------------------
Running benchmark with 1 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.81ms  698.12us  11.70ms   79.87%
    Req/Sec   150.00k    21.38k  220.44k    77.89%
  2980591 requests in 20.02s, 2.99GB read
Requests/sec: 148884.61
Transfer/sec:    153.06MB
--------------------------------------------------------
Running benchmark with 2 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms    1.45ms  39.26ms   71.19%
    Req/Sec    91.84k    14.08k  148.68k    89.75%
  3654511 requests in 20.04s, 3.67GB read
Requests/sec: 182341.35
Transfer/sec:    187.46MB
--------------------------------------------------------
Running benchmark with 4 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.03ms    1.52ms  29.70ms   68.30%
    Req/Sec    41.77k     6.60k   67.38k    91.25%
  3324769 requests in 20.03s, 3.34GB read
Requests/sec: 165965.16
Transfer/sec:    170.62MB
--------------------------------------------------------
Running benchmark with 8 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms    1.56ms  20.34ms   67.79%
    Req/Sec    20.03k     3.14k   32.57k    91.12%
  3188834 requests in 20.06s, 3.20GB read
Requests/sec: 159001.02
Transfer/sec:    163.46MB
--------------------------------------------------------
Running benchmark with 16 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.22ms    1.72ms  35.36ms   70.09%
    Req/Sec     9.82k     1.92k   40.33k    91.21%
  3134816 requests in 20.10s, 3.15GB read
Requests/sec: 155961.80
Transfer/sec:    160.34MB
stderr:
number of connections must be >= threads
number of connections must be >= threads
number of connections must be >= threads
[...]